# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
ser1 = pd.Series(np.random.randint(1, 5, 100))
ser2 = pd.Series(np.random.randint(1, 4, 100))
ser3 = pd.Series(np.random.randint(10000, 30000, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([ser1, ser2, ser3], axis=1)
df

    0  1      2
0   4  2  17883
1   3  3  10422
2   2  1  17672
3   4  2  14752
4   3  2  16095
.. .. ..    ...
95  4  3  12174
96  4  3  21417
97  3  2  14481
98  3  1  14371
99  4  2  10299

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       4       2            17883
1       3       3            10422
2       2       1            17672
3       4       2            14752
4       3       2            16095
..    ...     ...              ...
95      4       3            12174
96      4       3            21417
97      3       2            14481
98      3       1            14371
99      4       2            10299

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
bigcolumn = pd.concat([ser1, ser2, ser3])
bigcolumn = bigcolumn.to_frame()
type(bigcolumn)

pandas.core.frame.DataFrame

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [11]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(inplace=True)
bigcolumn

     index      0
0        0      4
1        1      3
2        2      2
3        3      4
4        4      3
..     ...    ...
295     95  12174
296     96  21417
297     97  14481
298     98  14371
299     99  10299

[300 rows x 2 columns]